# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import pandas as pd
import numpy as np

In [10]:
df1 = pd.Series([2, 4, 6, 8, 10])
df2 = pd.Series([1, 3, 5, 7, 9])
df3 = df1 + df2
print("Addition of Series")
print(df3)
df4 = df1 - df2
print("Subtraction of Series")
print(df4)
df5 = df1 * df2
print("Multiplication of Series")
print(df5)
df6 = df1 / df2
print("Division of Series")
print(df6)

Addition of Series
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction of Series
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication of Series
0     2
1    12
2    30
3    56
4    90
dtype: int64
Division of Series
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [12]:
dictionary = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
df1 = pd.Series(dictionary)
print(df1)

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [44]:
df1 = pd.Series([100, 200, 'python', 300.12, 400])
print("Original dataset")
print(df1)

print("Type cast dataset")
df1 = pd.to_numeric(df1,float)
df1

Original dataset
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Type cast dataset

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [23]:
df = pd.DataFrame({'col1':[1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]})
print("Original Dataframe")
print(df)
print("First column as a Series")
df_series = df['col1']
print(df_series)
type(df_series)

Original Dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
First column as a Series
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

pandas.core.series.Series

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [21]:
df = pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print("Original Data Series")
print(df)
print("Mean of Series - ", df.mean())
print("Standard Deviation of Series - ", df.std())

Original Data Series
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64
Mean of Series -  4.818181818181818
Standard Deviation of Series -  2.522624895547565

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [22]:
my_dict = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86], 'Z':[86,97,96,72,83]}
df = pd.DataFrame(my_dict)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [49]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'], 
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df
df.loc['a':'c', ['attempts', 'name', 'qualify', 'score']]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [57]:
exam_data = {'name' : [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score' : [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify' : ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df.loc[['b','d','f','g'], ['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [63]:
exam_data = {'name' : ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify' : ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes ']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=exam_data, index=labels)
print("Mean score for each different student in data frame :")
print(df['score'].mean())

Mean score for each different student in data frame :
13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [69]:
df = pd.DataFrame({'col1':[1,2,3], 'col2':[4,5,6], 'col3':[7,8,9]})
print("Original Dataframe :")
print(df)
new_columns = ['Column1', 'Column2', 'Column3']
df.columns = new_columns
print("New data frame after renaming columns:")
print(df)

Original Dataframe :
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New data frame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [11]:
"Dataset Not given"

'Dataset Not given'

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [6]:
df = pd.DataFrame({'col' : [1,4,3,4,5], 'col2' : [4,5,6,7,8], 'col3' : [7,8,9,0,1]})
pd.set_option('max_colwidth', 800)
pd.set_option('max_rows', 800)
pd.set_option('max_columns', 800)
df

   col  col2  col3
0    1     4     7
1    4     5     8
2    3     6     9
3    4     7     0
4    5     8     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [24]:
df = pd.DataFrame(['3/11/2000', '3/12/2000', '3/13/2000'], columns=['Date'])
print("Date String")
print(df)
print("Dataframe (string to datetime) - ")
print(pd.to_datetime(df['Date']))

Date String
        Date
0  3/11/2000
1  3/12/2000
2  3/13/2000
Dataframe (string to datetime) -
0   2000-03-11
1   2000-03-12
2   2000-03-13
Name: Date, dtype: datetime64[ns]

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [30]:
df = pd.DataFrame({})
print('Empty DataFrame')
print(df)
df.append(pd.DataFrame({'col1':[0,0,0,1], 'col2':[1,1,2,2]}))

Empty DataFrame
Empty DataFrame
Columns: []
Index: []

   col1  col2
0     0     1
1     0     1
2     0     2
3     1     2

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [35]:
df = pd.DataFrame({'col1':[1,2,3,4,7], 'col2':[4,5,6,9,5], 'col3':[7,8,12,1,11]})
print("Original DataFrame")
print(df)
print("Number of Columns -  ",len(df.columns))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Number of Columns -   3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [40]:
df = pd.DataFrame({'col1':[1,2,3,4,7, 11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]})
print("Original DataFrame")
print(df)
print("After removing last 3 rows of the DataFrame")
print(df[:-3])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
After removing last 3 rows of the DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [44]:
df = pd.read_excel(r'D:\Programming\iNeuron\Assignments\Assignment - Pandas\coalpublic2013.xlsx')
df.head(10)

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393
5  2013   103433              Crane Central Mine       69339        47195
6  2013   100329                    Concord Mine           0       144002
7  2013   100851                  Oak Grove Mine     2269014      1001809
8  2013   102901                Shoal Creek Mine           0        12396
9  2013   102901                Shoal Creek Mine     1453024      1237415

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [55]:
df = pd.read_excel(r'D:\Programming\iNeuron\Assignments\Assignment - Pandas\coalpublic2013.xlsx')
print(df[df['Mine_Name'].apply(lambda x:x.startswith('P'))])

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [73]:
import datetime
df = pd.read_excel(r'D:\Programming\iNeuron\Assignments\Assignment - Pandas\employee.xlsx')
df[df['hire_date'].apply(lambda x:x > pd.Timestamp(2007,1,1))]

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [102]:
year = int(input("Enter the specified year : "))
print("Entered year : ", year)
print()
df = pd.read_excel(r'D:\Programming\iNeuron\Assignments\Assignment - Pandas\employee.xlsx')
df[df['hire_date'].apply(lambda x:x.year == year)]

Enter the specified year : 2006
Entered year :  2006

    emp_id   first_name  last_name  hire_date
3      103    Alexander     Hunold 2006-01-03
6      106        Valli  Pataballa 2006-02-05
12     112  Jose Manuel      Urman 2006-03-07
18     118          Guy     Himuro 2006-11-15

## Great Job!